AR_reactor/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    waterInlet
    {
        type            fixedValue;
        value           uniform (0 0.05 0);
    }

    oilInletLeft
    {
        type            fixedValue;
        value           uniform (0.05 0 0);
    }

    oilInletRight
    {
        type            fixedValue;
        value           uniform (-0.05 0 0);
    }

    mainReactorOutlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }


    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
