AR_reactor/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    waterInlet
    {
        type            patch;
        nFaces          52;
        startFace       336216;
    }
    oilInletLeft
    {
        type            patch;
        nFaces          20;
        startFace       336268;
    }
    oilInletRight
    {
        type            patch;
        nFaces          20;
        startFace       336288;
    }
    mainReactorOutlet
    {
        type            patch;
        nFaces          160;
        startFace       336308;
    }
    wall
    {
        type            patch;
        nFaces          2772;
        startFace       336468;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          337728;
        startFace       339240;
    }
)

// ************************************************************************* //
